[
  {
    "id": "1733043143614",
    "content": "大致想了想未来几个月的几个if-else:\n\n1. 发完年终奖（假设1月份发）后，向boss提出涨薪，同意就留下，不同意就离职，回家过年。\n\n2. 如果离职，准备江苏事业单位考试，同时准备程序员面试。\n\n3. 如果抽中澳洲whv，直接润。",
    "timestamp": "2024-12-01T08:52:23.614Z"
  },
  {
    "id": "1732717306013",
    "content": "今天面了长桥证券。公司的对外名称是隆埠科技（long bridge)，音译过来的，以至于我以为是什么不知名外包公司。总共面了二十分钟，主要问了三个地方的知识：Go，CK，K8S。\n\n1. Go\n\n先问了一个map是否是并发安全。这个我感觉上次面试小公司的时候也被问道了。还有Go routine和一般线程的区别是什么。后面看我答不来这些八股，就问了用Go做了什么东西。\n\n2. CK\n\n他说CK他们也有在用，所以问的挺多。先问了CK怎么部署的，我说容器。让我举一个ck优化的例子，我说了一下通过改配置来降低单次查询内存占用上限。他问我有没有索引方面的优化，我说没有，有没有用过mergetree之外的引擎。\n\n3. K8S\n\n问的很少，忘了。\n",
    "timestamp": "2024-11-27T14:21:46.013Z"
  },
  {
    "id": "1732329606817",
    "content": "这周最后两天上班上的真鸡儿累。司马客户提的抽象需求一直没明白什么意思，好不容易给出来了，还要求更多。操了。\n\n另外，我原以为自己写文档的水平还不错的，至少比平均线高，毕竟经过硕士阶段论文的洗礼。结果这个项目里我写的文档总是不满足要求。更深层的原因是我对软件的理解不如老板深，写不出那么多东西来。\n\n还有沟通上的事情。客户经常说了一堆东西但是我听不懂，这时候不妨让他举个例子。",
    "timestamp": "2024-11-23T02:40:06.817Z"
  },
  {
    "id": "1731729818967",
    "content": "这几天有一个问题一直在我的脑海里打转：为什么中国经济发展了这么多年，且仍然保持一定增速的情况下，我还想润？\n\n同样得益于经济全球化和来自发达国家的产业转移，日本、韩国、台湾等经过几十年的高速发展，人均gdp均达到3万美元以上。即使把地区发展不均因素考虑进来，差距仍是巨大的。主要原因是中共执行的是“国富民穷”的底层逻辑。政府的税收绝大部分以建设基础设施等形式来刺激经济，而不是发放福利给普通民众。作为个人，中国不是一个负责的国家，你很难感受到政府对个人的关照，更多都是出台一些消费补贴政策，本质还是对宏观经济的调控。\n\n另外，中国文化的糟粕在现代和普世价值观差异太大，令人难以接收。",
    "timestamp": "2024-11-16T04:03:38.967Z"
  },
  {
    "id": "1731423289156",
    "content": "Golang并不像别人说的那样简单。\n\n很多人大概是把编程默认于java，所以接收起golang来很快。但是对于我这种一开始从前端、python入门，主力语言是Javascript这种动态语言的人来说，学习起来很费劲。首先要接收类型的束缚，声明变量不像以前那么方便。",
    "timestamp": "2024-11-12T14:54:49.156Z"
  },
  {
    "id": "1728747904504",
    "content": "进入十月份，没有睡几个好觉。我对合租的人弄出的声响越来越敏感，主要是关门声。楼上最近应该是搬来新的一家人，带小孩的。有个男的经常打呼噜震天响，我怎么也不明白，竟然能传到我这里，而且如此清晰。小孩的哭闹声、半夜12点拖椅子、还有不知道几层楼传下来的装修动静，都让我神经敏感。晚上躺在床上，我常常在快要入睡时，被一种莫名的恐惧拉起，感觉周围马上要传来关门声和拖拉椅子的动静。最近几天，到了下午就头晕，这都是睡眠不足的缘故。\n\n楼板薄成这样，这就是大部分中国人花了一身积蓄，结果买了一个自我折磨的“大宗商品”吗？而且年纪大了一点，对于合租也是越来越厌恶，厨房卫生间冰箱洗衣机，有点讨厌和别人共享这些东西了。\n\n这次即使不要押金，也得跑路了。",
    "timestamp": "2024-10-12T15:45:04.504Z"
  },
  {
    "id": "1728747185202",
    "content": "转眼间来上海已经半年了。这半年我的职位一直是Nodejs后端开发，当然，最近两个月也有做一些前端的活。工作内容和强度上，比较舒适，没有重复的劳动（就像上一份工作写sql到吐），工作环境宽松（不打卡，办公室宽敞）。能力也有进步，但是有一个问题，缺乏阶段性的回顾总结，导致对自己的能力范围模糊，还有下次遇到相同问题，解决起来还是不顺手。我决定，以后每周五晚上在这里写一个简单回顾，梳理自己这周运用了哪些技术工具，在哪些问题上收获较多。\n\n以这周为例。从gitlens插件的search&compare窗口可以看到自己的提交记录。\n\n1. 这周主要工作量还是在etl部分。一个是通过脚本直连hana数据库，还有是oracledb。\n2. 用git revert恢复历史。",
    "timestamp": "2024-10-12T15:33:05.202Z"
  },
  {
    "id": "1727839341485",
    "content": "- 又到一年国庆假期。看到朋友圈里有人又在这几天开启特种兵模式，每个城市玩两天，拍张照，文案感叹一下\"人多，但景美\"。想起上个月清迈旅游时和同行偶遇的新加坡人交谈时，她惊讶于中国人没有请长假的权利。平时没有假期，出行需求就只能集中于这些公共假期，造成了哪里都人山人海的局面。什么时候中国人才能拥有请长假休息的权利呢？\n\n- 节前一周，股市涨疯了。谁也不知道锚定物是什么？经济指标统统没有，只有政治局开了几个会，颁布了几个政策，大家就疯狂的往股市里冲，券商的开户申请都开始排队了。过阵子经济指标颁布，如果不及预期，标志着习近平这次大饼翻面又又又失败，股市肯定会迎来一波大跌。而且这次大跌将会比近几次来的更猛烈，跌破2000都有可能，甚至标志着中国衰败的正式到来。到时候我就可以开始做空了。",
    "timestamp": "2024-10-02T03:22:21.485Z"
  },
  {
    "id": "1727365183499",
    "content": "我将第N次重复react官网的[入门教程](https://zh-hans.react.dev/learn)\n",
    "timestamp": "2024-09-26T15:39:43.499Z"
  },
  {
    "id": "1727362479022",
    "content": "react,typescript,tailwindcss\n我的三块心病",
    "timestamp": "2024-09-26T14:54:39.022Z"
  }
]